#0)ჩანაწერს გადახედეთ თავიდან

#1)შექმენით სია შემდგარი 5 ელემენტისგან და გამოიტანეთ ამ სიის თითოეული ელემენტი ინდექსებით

#2)შექმენით სია შემდგარი 10 ელემენტისგან და გამოიტანეთ თითოეული ელემენტი for ციკლით / range() ფუნქციითაც და პირდაპირ ცვლადის გადაცემითაც

#3)შექმენით სია შემდგარი რიცხვებისგან, გადაუარეთ for ციკლით და გამოიტანეთ მხოლოდ ის რიცხვები რომელიც მეტია 10ზე

#4)შექმენით სია შემდგარი 7 განსხვავებული ემენეტისგან და for ციკლის მეშვეობით შეამოწმეთ თითოეული ემენეტის მონაცემთა ტიპი

#1)
my_list = [5, 12, 8, 3, 7]
for i in range(len(my_list)):
    print(f"Index {i}: {my_list[i]}")

#2)
my_list[0, 4, 5, 6, 29, 39, 93, 93, 88, 8]
for i in range(len[my_list]):
    print(f"index {i}: {my_list[i]}")


#3)
numbers = [5, 12, 8, 3, 7, 15, 20, 1]
for num in numbers:
    if num > 10:
        print(num)

#4)
mixed_list = [5, "Hello", 3.14, True, [1, 2, 3], None, {"key": "value"}]
for element in mixed_list:
    print(f"Element: {element}, Type: {type(element)}")
