//1) JavaScript'ში შეასრულეთ ყველა მათემატიკური ოპერაციები "+,-,>,<"...

//2) console'ში გამოიტანეთ თქვენი სახელი. 

//3) საიტის გაშვებისას alert'ის საშუალებთ მიესალმეთ მომხმარებელს.

//4) console.log()'ის დახმარებით გამოიტანეთ 2 სტრინგის კონკატენაცია.

//5) კომენტარის სახით ახსენით რა არის JavaScript და რაში გამოიყენება იგი.



//1)

console.log(5 + 67);
console.log(98 - 9);
console.log(298 > 9);
console.log(9 < 37);
console.log( 15 / 8);
console.log(9 * 28);

//2)

console.log("Nika");


//3) საიტის გაშვებისას alert'ის საშუალებთ მიესალმეთ მომხმარებელს

alert('Hello!');


//4)

consloe.log("Nika" + "Kukava");





//5)
// javascript  თავდაპირველად არ იყო პროგრამირების ენა ის მხოლოდ გამოიყენებოდა ბრაუზერებისთვის მაგრამ დროთა განმავბლობაში ის
// გადააქციეს
// პროგრამულ ენადაც და ერთ - ერთი ყველაზე ძლიერი  ენაა 
 // დღეს - დღეისობით იგი არის როგორც პროგრამირების ენა ასევე საიტებისთვისაც ანუ (ბრაუზერებისთვისაც).
 //phyton  და  javascript ის ენა რაღაცეებით ერთმანეთს გავს მაგალითად:
 // phyton  ში ტერმინალში პასუხის ანუ კოდის გაშვებას და შემოწმების დროს ვიყენებთ 
 // print() - ს რათა ვნახოთ კოდის შედეგი  მუშაობს იგი თუ არა

// javascript ში კი იგივე ნაირი რამე გააკეთეს და ქვია  console სადაც იგივე მოვალეობას აკეათბს უბრალოდ მას უფრო ვიყენებთ
// error ების გასარკვევასდ არის თუ არა ერორი სადმე.  log არის უბრალოდ  console ის  მეთოდი console კი გამოიყენება კოდის შესამოწმებლად
// მუშაობს თუ არა ჩვენი გაშვებული კოდი და როგორც ვთქვი ასევე error ერორების დასანახად და გასარკვევად
