#2) კომენტარის სახით ჩამოწერეთ თუ რა განსხვავებაა set-ებსა და list-ებს შორის.

#3) შექმენით set სადაც შეინახავთ რიცხვებს, შემდეგ კი ინდექსინგის საშუალებით სცადეთ თითოეული ელემენტის შეცვლა და დააკვირდით შედეგს.

#4) შექმენით set, რომელშიც შენახული გექნებათ Fast food საკვები პროდუქტები. შემდეგ კი ამოშალეთ ყველა პირვანდელი ელემენტები set-იდან, და მათ ნაცვლად დაამატეთ ჯანსაღი საკვები პროდუქტები.

#5) შექმენით ფუნქცია, რომელიც არგუმენტად იღებს სიას, და აბრუნებს იგივე სიას, მაგრამ დუპლიკატების გარეშე. hint: გააკეთეთ set-ის საშუალებით (output-ში ელემენტების თანმიმდევრობას მნიშვნელობა არ აქვს)

#test cases:

#list1 = [7, 5, 44, 14, 5, 5, 44]

#list2 = [89, 90, 56, 45, 90, 78, 90]

#2)
# - list არის ინდექსირებული, მასში ელემენტებს შეგვიძლია მივწვდეთ ინდექსით
# - set არ არის ინდექსირებული და არ ინახავს ელემენტებს განსაზღვრულ თანმიმდევრობით
# - list-ში შეიძლება დუპლიკატები, set-ში კი ყველა ელემენტი უნიკალურია
# - set უფრო სწრაფად ამოწმებს ელემენტის არსებობას

#3)
nums = {10, 20, 30, 40}
try:
    nums[0] = 100 
except TypeError as e:
    print(e)


#4)
fast_food = {"Burger", "Fries", "Pizza", "Hotdog"}
fast_food.clear()
fast_food.update({"Salad", "Avocado", "Quinoa", "Smoothie"})
print( fast_food)

#5)
def remove_duplicates(input_list):
    return list(set(input_list))  

list1 = [7, 5, 44, 14, 5, 5, 44]
list2 = [89, 90, 56, 45, 90, 78, 90]

print(remove_duplicates(list1))
print(remove_duplicates(list2))