#1)შექმენით 2 ცვლადი სახელად 
# დაარქვით მაგალითად:num1 და num2, მნიშვნელობებად გადაეცით რიცხვები და მოახდინეთ მათზე
#  მათემატიკური ოპერაციები, მაგალითად :
# მიმატება(+),გამოკლება(-),გამრავლება(*),გაყოფა(/) და კომენტარებით ახსენით თითოეული ოპერაცია რას აკეთებს

num1 = 5
num2 = 7

#ეს მაგალით უმატებს ერთმანეთს 
print(num1 + num2)

# ეს მაგალით აკლებს ერთმანეთს 
print(num2 - num1)

# ეს მაგალით ამრავლებს ერთმანეთზე
print(num1 * num2)

# ეს მაგალით ყოფს ერთმანეთზე
print(num2/num1)


#2)შექმენით ცვლადი age და მნიშვნელობად გადაეცით თქვენი ასაკი,შექმენით ახალი ცვლადი სადაც 
# იქნება თქვენი ასაკი 5 წლის შემდეგ, ბოლოს კი გამოიტანეთ რამდენი წლის იქნებით 5 წლის შემდეგ.

age = 16
newage = 16 + 5
print(newage)

#3)შექმენით ორი ცვლადი  რომელსაც მნიშვნელობად გადასცემთ თქვენს ასაკს მეორეში კი მშობლის ასაკს
#  ,შემდეგ კი თქვენი ასაკი და მშობლის ასაკი გაამრავლეთ ერთმანეთზე.

myage = 16
mother = 65
print(myage * mother)

#4)თქვენი ოჯახის წევრების ასაკები ჩამოწერეთ ცვლადების სახით, დაპრინტეთ მათი ასაკები ხელმეორედ, 2 წლის შემდეგ.
mother = 65
father = 70
newmotherage = 65 + 2
newfatherage = 70 + 2
print(newmotherage, newfatherage)

#5)შექმენით ცვლადი name რომელშიც შეინახავთ თქვენ სახელს და შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა
#  და ჩაწერეთ თქვენი მეგობრის სახელი, საბოლოოდ დაბეჭდეთ name ცვლადი

name = "nika"
newname = "gio"
print(newname)

