#1) შექმენით სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.

#2)შექმენით სია სადაც იქნება 10 ელემენტი გამოიტანეთ,მე0 ინდექსიდან მე_8 ინდექსის ჩათვლით ყველა ელემენტი.

#3)შექმენით სია სადაც იქნება ხუთი რიცხვი, გადაუარეთ ამ სიას for ციკლის საშუალებით და შეამოწმეთ თუ სიიდან რომელიმე რიცხვი ნაკლებია 5ზე დავბეჭდოთ ის რიცხვი.

#4)შექმენით სია სადაც იქნება 10 რიცხვი და შექმენით sum ცვლადი რომლის საშუალებითაც გამოითვლით ამ ყველა რიცხვის ჯამს.

#5)კომენტარებით ახსენით რისი გაკეთება შეგვიძლია slicing ით.

#1)
numbers = [2, 3, 4, 5]
product = 1
for number in numbers:
    product *= number
print( product)

#2)
numbers = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
subset = numbers[0:9]
print( subset)

#3)
numbers = [3, 7, 1, 9, 4]
for num in numbers:  
    if num < 5:       
        print(num) 

#4)
numbers = [5, 8, 12, 3, 7, 9, 4, 6, 10, 2] 
sum_numbers = 0  
for num in numbers: 
    sum_numbers += num 
print(sum_numbers)  

#5)
numbers = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

# 1.
print(numbers[:3])

# 2.
print(numbers[3:7])

# 3.
print(numbers[-3:]) 

# 4.
print(numbers[::2])

# 5.
print(numbers[::-1])

