#1)კომენტარის მეშვეობით ახსენით რა არის bug და debugging.
# debugging გვეხმარება ჩვენი  კოდის გასწორბაში და გამართვაში
# bug იც გვეხმარება კოდის გამართვაში ოღონდ უფრო სიღრმისეულად მაგ: რაღაც აკლია კოდს მაგალითად = ბა აკლია ყველა ასეთ დეტალების 
# გამოსაჭერად გვეხმარება bug

#2)დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.
# მაგ: ეს არის არასწორი კოდი
#num1  8
#num2 20
# print 8 + "20"

# ეს არის გამოსწორებული კოდი
num1 = 8
num2 = 20
print(8 + 20)

#3)გააკეთეთ ხუთ ხუთი მაგალითი ყველა გავლილ მათემატიკურ ოპერატორზე.

# მიმატება
print(120 + 100)
print(39 + 82)
print(302 + 938)
print(283 + 929)
print(8822 + 0)

# გამოკლება
print(120-100)
print(120- 9)
print(120-8)
print(120-29)
print(120-120)


# გამრავლება
print(91 * 92)
print(23 * 223)
print(32 * 543)
print(34 * 3)
print(32 * 322)

# გაყოფა
print(3 / 9)
print(32 / 2)
print(33 / 3)
print(343 / 42)
print(323 / 9)

#4)შექმენით ცვლადები და შიგნით შეინახეთ თქვენი ოჯახის წევრების ასაკები, საბოლოოდ დაბეჭდეთ ყველა ასაკის ჯამი.

mother = 65
father = 70
print(65 + 70 )

