#1)კომენტარის სახით ახსენით required / disabled / name / for / id / type ატრიბუტების დანიშნულებელი და რასთან ვიყენებთ

#2)შექმენით სარეგისტრაციო ფორმა, სადაც მომხმარებელს შემოატანინებთ: სახელს, გვარს, ემაილს, პაროლს და ამ ფორმაში ჩააშენეთ drop down menu, სადაც მომხმარებელს შეეკითხებით მის ქვეყანას (georgia, france, spain...)

#3)შექმენით საიტი თქვენს საყვარელ იუთუბერებზე, სადაც გექნებათ heading-ით გამოტანილი ამ იუთუბერის სახელი, პარაგრაფით დაწერილი მასზე მცირე ინფორმაცია და უნდა გქონდეთ დართული მათი ერთერთი ვიდეო <video> თეგის გამოყენებით, ქვემოთ კი დაამატეთ ღილაკი რომელიც გადაგიყვანთ მათ იუთუბ არხზე (უნდა გქონდეთ მინიმუმ 3 მაგალითი)-->


#1)
#required ამ ატრიბუტის გამოყენება აუცილებელია, როდესაც სურს, რომ მომხმარებელმა აუცილებლად შეავსოს ველი.
 # მაგ: <input type="text" required>
#disabled აღნიშნავს რომ ელემენტი არ არის ხელმისაწვდომი მომხმარებლისთვის ანუ მომხმარებელი ვერ შეძლებს მისი ქცევის შეცვლას.
 #მაგ: <input type="text" disabled />
# name ატრიბუტი, რომელიც განსაზღვრავს ელემენტის სახელწოდებას და გამოიყენება ფორმის მონაცემების გაგზავნის დროს. ეს სახელწოდება იქნება გამოყენებული მონაცემების გადაცემისას სერვერზე.
 #მაგ: <input type="text" name="username" />
# for ატრიბუტი, რომელიც უკავშირდება <label> ელემენტს შესაბამის ფორმის ელემენტთან. მისი გამოყენებით შეგიძლიათ დააკავშიროთ ლეიბელი კონკრეტულ ინფუთ ველთან.
 #მაგ: <label for="username">Username</label><input type="text" id="username" />
# id ატრიბუტი, რომელიც უნიკალურად აღწერს ელემენტს დოკუმენტში. id ხშირად გამოიყენება JavaScript-თან ან CSS-თან ინტეგრაციაში.~
 #მაგ: <input type="text" id="username" />
# type ატრიბუტი, რომელიც განსაზღვრავს ინპუტ ველის ტიპს (მაგალითად, ტექსტი, პაროლი, სია და ა.შ.).
 #მაგ: <input type="password" />